In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier

In [3]:
df = pd.read_csv("/mnt/c/Users/mercg/Downloads/salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [7]:
X = df.drop(columns= 'salary_more_then_100k')
Y = df['salary_more_then_100k']

In [10]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [12]:
X['company_n'] = le_company.fit_transform(X['company'])
X['job_n'] = le_job.fit_transform(X['job'])
X['degree_n'] = le_degree.fit_transform(X['degree'])

In [13]:
X.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [14]:
X = X.drop(columns=['company', 'job', 'degree'])
X.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [15]:
model = DecisionTreeClassifier()
model.fit(X,Y)
model.score(X,Y)

1.0

In [16]:
df = pd.read_csv("/mnt/c/Users/mercg/Downloads/titanic.csv")
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [17]:
data = df.drop(columns= ['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'])
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [18]:
X = data.drop(columns= 'Survived')
Y = data['Survived']

In [20]:
le = LabelEncoder()
X['Sex'] = le.fit_transform(X['Sex'])

In [41]:
X_train, X_test, y_train, y_test = train_test_split(X,Y, test_size= 0.2)
from imblearn.over_sampling import RandomOverSampler
ros = RandomOverSampler()
X_train_scaled, y_train_scaled = ros.fit_resample(X_train,y_train)

In [42]:
model.fit(X_train_scaled, y_train_scaled)
model.score(X_test, y_test)

0.7430167597765364

In [43]:
y_train_scaled

0      0
1      1
2      1
3      1
4      1
      ..
895    1
896    1
897    1
898    1
899    1
Name: Survived, Length: 900, dtype: int64